# frozen_string_literal: true

tap 'homebrew/cask'
tap 'shopify/shopify'

# install/update deps
brew 'vim'

# zsh
brew 'zsh'
brew 'antigen'

# js
brew 'typescript'

# development
cask 'docker'
brew 'openssl'
brew 'asdf' # version manager for node + ruby
brew "pyenv" # version manager python
brew "pipx" # python package manager
brew 'node-builder'
brew 'shopify-cli'


brew 'jesseduffield/lazygit/lazygit'
brew 'lazygit'
brew 'postgresql'
brew 'redis'


cask 'iterm2'
cask 'tableplus'
cask 'visual-studio-code'

# design
cask 'sketch'

# social
cask 'slack'
cask 'discord'

# productivity
cask 'spectacle'
cask 'brave-browser'

# misc
cask 'spotify'
cask 'lastpass'
