tap "homebrew/cask"

# install/update deps
brew "node"
brew "git"
brew "yarn"
brew "vim"

# ruby
brew "ruby-build"
brew "chruby"

# zsh
brew zsh
brew "antigen"

# browsers
cask "Google-chrome"
cask "firefox"

# development
brew "awscli"
brew "typescript"
brew "redis"

cask "postgres"
cask "tableplus"
cask "alacritty"
cask "visual-studio-code"
cask "sourcetree"
cask "docker"

# design
cask "iconjar"
cask "sketch"

# social
cask "slack"
cask "spectacle"

# productivity
cask "notion"
mas "todoist", id: 585829637

# misc
cask "spotify"
cask "adguard"
cask "lastpass"
cask "fzf"