tap "homebrew/cask"

# install/update deps
brew "node"
brew "git"
brew "vim"

# zsh
brew "zsh"
brew "antigen"

# ruby
brew "ruby-build"
brew "chruby"

# js
brew "nvm"
brew "typescript"

# development
cask "docker"

brew "jesseduffield/lazygit/lazygit"
brew "lazygit"
brew "postgresql"
brew "redis"

cask "iterm2"
cask "tableplus"
cask "visual-studio-code"

# design
cask "sketch"

# social
cask "slack"
cask "discord"

# productivity
cask "spectacle"
cask "brave-browser"

# misc
cask "spotify"
cask "lastpass"
